Revit 2027 API
RebarConstraint.SetDistanceToTargetHostEdge Method
 Sets the distance from the RebarConstrainedHandle to the target host edge. The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' and must allow offset value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDistanceToTargetHostEdge(
	double distanceToTargetEdge
)
Public Sub SetDistanceToTargetHostEdge (
	distanceToTargetEdge As Double
)
public:
void SetDistanceToTargetHostEdge(
	double distanceToTargetEdge
)
member SetDistanceToTargetHostEdge :
        distanceToTargetEdge : float -> unit
Parameters
distanceToTargetEdge Double
 The distance to target host edge.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for distanceToTargetEdge must be no more than 30000 feet in absolute value.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToHostEdge'. -or- The RebarConstrainedHandle doesn't allow distance for constraint of ToHostEdge or ToHostEdgeCover type.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace